## Final Quiz

### Question 1
Consider the given NumPy arrays a and b. What will be the value of c after the following code is executed?

In [1]:
import numpy as np

a = np.arange(8)
b = a[4:6]
b[:] = 40
c = a[4] + a[6]

print (c)

46

### Question 2
Given the string s as shown below, which of the following expressions will be True?

In [2]:
import re
s = 'ABCAC'
bool(re.match('A', s)) == True

True

### Question 3
Consider a string s. We want to find all characters (other than A) which are followed by triple A, i.e., have AAA to the right. We don’t want to include the triple A in the output and just want the character immediately preceding AAA . Complete the code given below that would output the required result.

In [6]:
def result():
    s = 'ACAABAACAAABACDBADDDFSDDDFFSSSASDAFAAACBAAAFASD'

    result = []
    # compete the pattern below
    pattern = "(\w)(?=[A]{3})"            
    for item in re.finditer(pattern, s):
      # identify the group number below.
      result.append(item.group())
      
    return result

result()

['C', 'F', 'B']

### Question 4

![file](quiz4_q4.png)

Consider the following 4 expressions regarding the above pandas Series df. All of them have the same value except one expression. Can you identify which one it is?

In [9]:
import pandas as pd
df=pd.Series({'d':4,'b':7,'a':-5,'c':3})
#df #ok
df.index[0]

'd'

### Question 5

![file](quiz4_q5.png)

Consider the two pandas Series objects shown above, representing the no. of items of different yogurt flavors that were sold in a day from two different stores, s1 and s2. Which of the following statements is True regarding the Series s3 defined below?

In [12]:
s1=pd.Series({
    'Mango':20,
    'Strawberry':15,
    'Blueberry':18,
    'Vanilla':31
})

s2=pd.Series({
    'Mango':20,
    'Strawberry':20,
    'Vanilla':30,
    'Banana':15,
    'Plain':20
})

s3 = s1.add(s2)
s3['Mango'] >=  s1.add(s2, fill_value = 0)['Mango']

True

### Question 6
In the following list of statements regarding a DataFrame df, one or more statements are correct. Can you identify all the correct statements?


- &#9745; Every time we call df.set_index(), the old index will be discarded.
- &#9744; Every time we call df.set_index(), the old index will be set as a new column.
- &#9744; Every time we call df.reset_index(), the old index will be discarded.
- &#9745; Every time we call df.reset_index(), the old index will be set as a new column.

### Question 7
Consider the Series object S defined below. Which of the following is an incorrect way to slice S such that we obtain all data points corresponding to the indices 'b', 'c', and 'd'?

In [13]:
S = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
S['b':'e']

b    1
c    2
d    3
e    4
dtype: int32

### Question 8

![file](quiz4_q8.png)

Consider the DataFrame df shown above with indexes 'R1', 'R2', 'R3', and 'R4'.  In the following code, a new DataFrame df_new is created using df. What will be the value of df_new[1] after the below code is executed?

In [15]:
df = pd.DataFrame([
    {'a':5,'b':6,'c':20},
    {'a':5,'b':82,'c':28},
    {'a':71,'b':31,'c':92},
    {'a':67,'b':37,'c':49}], 
    index=['R1', 'R2', 'R3','R4'])
df

f = lambda x: x.max() + x.min()
df_new = df.apply(f)
df_new[1]

88

### Question 9

![file](quiz4_q9.1.png)

Consider the DataFrame named new_df shown above. Which of the following expressions will output the result (showing the head of a DataFrame) below?

![file](quiz4_q9.2.jpg)

In [21]:
import pandas as pd
import numpy as np
df = pd.read_csv('datasets/cwurData.csv')
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [22]:
def create_category(ranking):
    if (ranking >= 1) & (ranking <= 100):
        return "First Tier Top Unversity"
    elif (ranking >= 101) & (ranking <= 200):
        return "Second Tier Top Unversity"
    elif (ranking >= 201) & (ranking <= 300):
        return "Third Tier Top Unversity"
    return "Other Top Unversity"

df['Rank_Level'] = df['world_rank'].apply(lambda x: create_category(x))

new_df=df.pivot_table(values='score', index='country', columns='Rank_Level', aggfunc=[np.mean, np.max], 
               margins=True)

# new_df.head()
new_df.unstack().unstack()

country                         Argentina  Australia    Austria    Belgium  \
     Rank_Level
mean First Tier Top Unversity         NaN  47.942500        NaN  51.875000
     Other Top Unversity        44.672857  44.645750  44.864286  45.081000
     Second Tier Top Unversity        NaN  49.242500        NaN  49.084000
     Third Tier Top Unversity         NaN  47.285000  47.066667  46.746667
     All                        44.672857  45.825517  45.139583  47.011000
amax First Tier Top Unversity         NaN  51.610000        NaN  52.030000
     Other Top Unversity        45.660000  45.970000  46.290000  46.210000
     Second Tier Top Unversity        NaN  50.400000        NaN  49.730000
     Third Tier Top Unversity         NaN  47.470000  47.780000  47.140000
     All                        45.660000  51.610000  47.780000  52.030000

country                            Brazil  Bulgaria     Canada    Chile  \
     Rank_Level
mean First Tier Top Unversity         NaN       NaN  53.633846      NaN
     Other Top Unversity        44.499706    44.335  44.760541  44.7675
     Second Tier Top Unversity  49.565000       NaN  49.218182      NaN
     Third Tier Top Unversity         NaN       NaN  46.826364      NaN
     All                        44.781111    44.335  47.359306  44.7675
amax First Tier Top Unversity         NaN       NaN  60.870000      NaN
     Other Top Unversity        46.080000    44.480  45.740000  45.3300
     Second Tier Top Unversity  49.820000       NaN  51.230000      NaN
     Third Tier Top Unversity         NaN       NaN  47.690000      NaN
     All                        49.820000    44.480  60.870000  45.3300

country                             China  Colombia  ...  Switzerland  \
     Rank_Level                                      ...
mean First Tier Top Unversity   53.592500       NaN  ...    54.005000
     Other Top Unversity        44.564267   44.4325  ...    44.625000
     Second Tier Top Unversity  47.868000       NaN  ...    48.184000
     Third Tier Top Unversity   46.926250       NaN  ...    47.930000
     All                        44.992575   44.4325  ...    51.208846
amax First Tier Top Unversity   55.300000       NaN  ...    72.180000
     Other Top Unversity        45.920000   44.8500  ...    45.050000
     Second Tier Top Unversity  48.140000       NaN  ...    49.170000
     Third Tier Top Unversity   47.760000       NaN  ...    47.930000
     All                        55.300000   44.8500  ...    72.180000

country                            Taiwan   Thailand  Turkey         USA  \
     Rank_Level
mean First Tier Top Unversity   54.210000        NaN     NaN   61.066726
     Other Top Unversity        44.476667  44.830000  44.481   44.871718
     Second Tier Top Unversity        NaN        NaN     NaN   49.069524
     Third Tier Top Unversity   47.065000  46.550000     NaN   46.818333
     All                        45.012391  45.116667  44.481   51.839860
amax First Tier Top Unversity   54.230000        NaN     NaN  100.000000
     Other Top Unversity        45.490000  45.860000  45.570   46.300000
     Second Tier Top Unversity        NaN        NaN     NaN   51.270000
     Third Tier Top Unversity   47.160000  46.550000     NaN   47.820000
     All                        54.230000  46.550000  45.570  100.000000

country                         Uganda  United Arab Emirates  United Kingdom  \
     Rank_Level
mean First Tier Top Unversity      NaN                   NaN       63.937931
     Other Top Unversity         44.28                 44.22       44.881299
     Second Tier Top Unversity     NaN                   NaN       48.957500
     Third Tier Top Unversity      NaN                   NaN       46.862273
     All                         44.28                 44.22       49.474653
amax First Tier Top Unversity      NaN                   NaN       97.640000
     Other Top Unversity         44.40                 44.36       46.300000
     Second Tier Top Unversity     NaN                   NaN       49.970000
     Third Tier Top Unversity      NaN                   NaN       47.740000
     All                         44.40                 44.36       97.640000

country                         Uruguay         All
     Rank_Level
mean First Tier Top Unversity       NaN   58.350675
     Other Top Unversity         44.255   44.738871
     Second Tier Top Unversity      NaN   49.065450
     Third Tier Top Unversity       NaN   46.843450
     All                         44.255   47.798395
amax First Tier Top Unversity       NaN  100.000000
     Other Top Unversity         44.350   46.340000
     Second Tier Top Unversity      NaN   51.290000
     Third Tier Top Unversity       NaN   47.930000
     All                         44.350  100.000000

[10 rows x 60 columns]

### Question 10

![file](quiz4_q10.png)

Consider the DataFrame df shown above. What will be the output (rounded to the nearest integer) when the following code related to df is executed:

In [23]:
df = pd.DataFrame([
    {'Item':'item_1','Store':'A','Quantity sold':10},
    {'Item':'item_1','Store':'B','Quantity sold':20},
    {'Item':'item_1','Store':'C','Quantity sold':None},
    {'Item':'item_2','Store':'A','Quantity sold':5},
    {'Item':'item_2','Store':'B','Quantity sold':10},
    {'Item':'item_2','Store':'C','Quantity sold':15}])


df.groupby('Item').sum().iloc[0]['Quantity sold']

30.0